NordicPlayground/nRF5-flash-storage-examples/pstorage_example/main.c
		printf("pstorage store into block 1 \r\n");
		pstorage_store(&block_1_handle, source_data_1, 16, 0);     //Write to flash, only one block is allowed for each pstorage_store command		
		pstorage_wait_handle = block_2_handle.block_id;            //Specify which pstorage handle to wait for
		pstorage_wait_flag = 1;                                    //Set the wait flag. Cleared in the example_cb_handler
		printf("pstorage store into block 2\r\n    Data written into block 2: %s\r\n", source_data_9);
		pstorage_store(&block_2_handle, source_data_9, 16, 0);     //Write to flash
		printf("pstorage wait for block 2 store to complete ... \r\n");
		while(pstorage_wait_flag) { power_manage(); }              //Sleep until store operation is finished.
		
		printf("pstorage load blocks 0 \r\n");
		pstorage_load(dest_data_0, &block_0_handle, 16, 0);				 //Read from flash, only one block is allowed for each pstorage_load command
		printf("pstorage load blocks 1 \r\n");
		pstorage_load(dest_data_1, &block_1_handle, 16, 0);				 //Read from flash
		printf("pstorage load blocks 2\r\n");
		pstorage_load(dest_data_2, &block_2_handle, 16, 0);			   //Read from flash
		printf("    Data loaded from block 2: %s\r\n", dest_data_2);
		
		printf("pstorage clear 32 bytes from block 0 \r\n");
		pstorage_wait_handle = block_0_handle.block_id;            //Specify which pstorage handle to wait for
		pstorage_wait_flag = 1;                                    //Set the wait flag. Cleared in the example_cb_handler
		pstorage_clear(&block_0_handle, 32);                       //Clear 32 bytes
		printf("pstorage wait for clear to complete ... \r\n");
		while(pstorage_wait_flag) { power_manage(); }              //Sleep until store operation is finished.
		
		printf("pstorage load blocks 0 \r\n");
		pstorage_load(dest_data_0, &block_0_handle, 16, 0);				 //Read from flash, only one block is allowed for each pstorage_load command
		printf("pstorage load blocks 1 \r\n");
		pstorage_load(dest_data_1, &block_1_handle, 16, 0);				 //Read from flash
		printf("pstorage load blocks 2 \r\n");
		pstorage_load(dest_data_2, &block_2_handle, 16, 0);			   //Read from flash
		
		printf("pstorage update block 0 \r\n");
		pstorage_wait_handle = block_0_handle.block_id;            //Specify which pstorage handle to wait for 
		pstorage_wait_flag = 1;                                    //Set the wait flag. Cleared in the example_cb_handler
		pstorage_update(&block_0_handle, source_data_9, 16, 0);    //update flash block 0
		printf("pstorage wait for update to complete ... \r\n");
		while(pstorage_wait_flag) { power_manage(); }              //Sleep until update operation is finished.
		
		printf("pstorage load blocks 0  \r\n");
		pstorage_load(dest_data_0, &block_0_handle, 16, 0);				 //Read from flash, only one block is allowed for each pstorage_load command
		printf("pstorage load blocks 1 \r\n");
		pstorage_load(dest_data_1, &block_1_handle, 16, 0);				 //Read from flash
		printf("pstorage load blocks 2 \r\n");
		pstorage_load(dest_data_2, &block_2_handle, 16, 0);			   //Read from flash
}

/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
    timers_init();
		uart_config();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    device_manager_init(erase_bonds);
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();

    // Start execution.
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
	
		pstorage_test_store_and_update();

    // Enter main loop.
    for (;;)
    {
        power_manage();
    }
}

/**
 * @}
 */
